In [1]:
import numpy as np

In [2]:
import pandas as pd

### Creating DF using dictionary

In [4]:
d = {'A': [1, 2, np.nan], 'B': [3, np.nan, np.nan], 'C': [4, 5, 6]}

In [5]:
df = pd.DataFrame(d)

In [6]:
df

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  6

### Droping null values

In [7]:
df.dropna()

     A    B  C
0  1.0  3.0  4

In [9]:
# Dropping null valued columns
df.dropna(axis=1)

   C
0  4
1  5
2  6

In [10]:
# Dropping with threshold
df.dropna(thresh=2)

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5

### Filling null values

In [11]:
df.fillna(value='String')

        A       B  C
0       1       3  4
1       2  String  5
2  String  String  6

In [12]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64